app/views/users/show.html.erb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
<ul>
  <% @user.microposts.each do |micropost| %>

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
<ul>
  <% @user.comments.each do |comment| %>