app/views/microposts/show.html.erb

<ul>
  <% @micropost.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 2]]