app/controllers/comments_controller.rb

  def create
    puts "PARAMS:"
    puts params
    # puts params[:comment]
    if params[:comment].key?(:micropost_id)
      # if the micropost doesn't exist, return an error
      puts "HERE"
      @micropost = Micropost.find(params[:comment][:micropost_id]) # not finding it?
      # @comment = Comment.new(comment_params)
      puts "HERE2"
      @comment = @micropost.comments.build(comment_params)

      respond_to do |format|
        if @comment.save
---
INSERT INTO "comments" ("commenter", "body", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Carina Quan"], ["body", "LGTM"], ["micropost_id", 1], ["created_at", "2023-11-01 23:14:53.010913"], ["updated_at", "2023-11-01 23:14:53.010913"]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "OKkk"], ["updated_at", "2023-11-01 23:45:55.799667"], ["id", 4]]