app/controllers/comments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    if params.key?(:user_id)
      @user = User.find(params[:user_id])
    end
    if params.key?(:micropost_id)
      @micropost = Micropost.find(params[:micropost_id])
    end
    @comment = Comment.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def new
    if params.key?(:user_id)
      @user = User.find(params[:user_id])
      @micropost = @user.microposts.find(params[:micropost_id])
    else
      @micropost = Micropost.find(params[:micropost_id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(params[:id])
    @micropost = Micropost.find(@comment.micropost_id)

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "micropost_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Carina Quan"], ["body", "2122"], ["micropost_id", 1], ["created_at", "2023-11-03 08:26:55.076858"], ["updated_at", "2023-11-03 08:26:55.076858"], ["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "micropost_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Carina Quan"], ["body", "sssss222111"], ["micropost_id", 1], ["created_at", "2023-11-03 08:21:46.641207"], ["updated_at", "2023-11-03 08:21:46.641207"], ["user_id", 1]]
---
  def create
    if params[:comment].key?(:user_id)
      puts "TESTING"
      puts params[:comment][:user_id]
      # if the micropost doesn't exist, return an error
      @micropost = Micropost.find(params[:comment][:micropost_id])
      @user = User.find(params[:comment][:user_id])
      # @micropost = @user.microposts.find(params[:comment][:micropost_id])
      @comment = @micropost.comments.build(comment_params)
      # @comment.user = @user
      respond_to do |format|
        if @comment.save
          format.html { redirect_to user_micropost_comment_url(@user, @micropost, @comment), notice: "Comment was successfully created." }
          format.json { render :show, status: :created, location: @comment }
        else
          format.html { render :new, status: :unprocessable_entity }
          format.json { render json: @comment.errors, status: :unprocessable_entity }
        end
      end
    else
      @micropost = Micropost.find(params[:comment][:micropost_id])
      # @comment = @micropost.comments.build(comment_params)
      @comment = Comment.new(comment_params)
      @comment.user = @user

      respond_to do |format|
        if @comment.save

UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "inline1"], ["updated_at", "2023-11-03 19:49:39.916647"], ["id", 20]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 24]]
---
  def destroy
    @comment.destroy!