app/controllers/microposts_controller.rb

  def index
    if params.key?(:user_id)
      @user = User.find(params[:user_id])
    end
    @microposts = Micropost.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts"

  def show
    if params.key?(:user_id)
      @user = User.find(params[:user_id])
    end
    @micropost = Micropost.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    if params.key?(:user_id)
      @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    puts "IN CREATE"
    puts params
    if params.key?(:user_id)
      puts "USERID EXISTS"
      @user = User.find(params[:user_id])
      @micropost = @user.microposts.build(micropost_params)

      respond_to do |format|
        if @micropost.save
          format.html { redirect_to user_micropost_url(@user, @micropost), notice: "Micropost was successfully created." }
          format.json { render :show, status: :created, location: @micropost }
        else
          format.html { render :new, status: :unprocessable_entity }
          format.json { render json: @micropost.errors, status: :unprocessable_entity }
        end
      end
    else
      puts "USERID DOES NOT EXIST"
      @micropost = Micropost.new(micropost_params)
      respond_to do |format|
        if @micropost.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "microposts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "asdf"], ["content", "asdf"], ["user_id", 1], ["created_at", "2023-11-01 21:58:02.235245"], ["updated_at", "2023-11-01 21:58:02.235245"]]
INSERT INTO "microposts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Test title 2"], ["content", "This is the test posting micro post"], ["user_id", 2], ["created_at", "2023-11-02 20:42:37.978653"], ["updated_at", "2023-11-02 20:42:37.978653"]]

  def update
    respond_to do |format|
      if @micropost.update(micropost_params)
---
UPDATE "microposts" SET "content" = ?, "updated_at" = ? WHERE "microposts"."id" = ?  [["content", "content test123"], ["updated_at", "2023-11-03 19:50:07.381211"], ["id", 3]]

  def destroy
    @micropost.destroy!
---
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 1]]

    def set_micropost
      @micropost = Micropost.find(params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]