app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_micropost
      @micropost = Micropost.find(params[:id])