app/controllers/microposts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    puts "IN CREATE"
    puts params
    if params.key?(:user_id)
      puts "USERID EXISTS"
      @user = User.find(params[:user_id])