app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "user6"], ["email", "6"], ["created_at", "2023-11-01 17:38:01.448804"], ["updated_at", "2023-11-01 17:38:01.448804"]]